UpDirection Property
 The direction towards the top of the screen.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public XYZ UpDirection { get; }
  Visual Basic
Public ReadOnly Property UpDirection As XYZ
	Get
  Visual C++
public:
property XYZ^ UpDirection {
	XYZ^ get ();
}
 See Also
  View Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →